#+title: Rails on Kubernetes with TLS
#+subtitle: certmanager
#+tags[]: rails kubernetes terraform github
#+date: 2021-07-16
#+aliases[]: /articles/2021/rails_on_kubernetes_with_tls

I wanted to see how to really use kubernetes like I'm used to using
heroku, so lets recreate everything using terraform, digital ocean,
kubernetes and MAGIC!

** Option 2: Setup using =cluster-issuer.yml=

Instead of using the =kubernetes-alpha= way of setting up the cluster
issuer, we can do a simple =yml= file and do it the kubectl way.

=cluster-issuer.yml=:

#+begin_src yaml :tangle cluster-issuer.yml
  apiVersion: cert-manager.io/v1
  kind: ClusterIssuer
  metadata:
    name: letsencrypt-prod
  spec:
    acme:
      # You must replace this email address with your own.
      # Let's Encrypt will use this to contact you about expiring
      # certificates, and issues related to your account.
      email: wschenk@gmail.com
      server: https://acme-v02.api.letsencrypt.org/directory
      privateKeySecretRef:
        name: issuer-account-key
      # Add a single challenge solver, HTTP01 using nginx
      solvers:
      - http01:
          ingress:
            class: nginx
#+end_src

Then apply it

#+begin_src bash
  kubectl apply -f cluster-issuer.yml
#+end_src

And we can look at it like so

#+begin_src bash :results output
  kubectl describe clusterissuer letsencrypt-prod
#+end_src

#+begin_src bash :results output
  kubectl get cert --namespace favoriteapp
#+end_src

#+RESULTS:
: NAME                 READY   SECRET               AGE
: issuer-account-key   True    issuer-account-key   34m

